---
kind: other
id: Methods.T:Autodesk.Revit.DB.Lighting.RectangleLightShape
source: html/5991f55c-adae-a4f5-70fa-bec72c83229a.htm
---
# RectangleLightShape Methods

Creates a copy of the LightShape derived object.